// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1




Console.WriteLine("Введите 3-х значное число:");
int num = Convert.ToInt32(Console.ReadLine());
int first = num / 100;
int second = num / 10;
int result = second - first * 10;
Console.Write($"{num} -> {result}");




//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//




// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6





Console.WriteLine("Введите любое число: ");
int Num = Convert.ToInt32(Console.ReadLine());
string NumText = Convert.ToString(Num);
if (NumText.Length > 2)
{
    Console.WriteLine($"{Num} -> {NumText[2]}");
}
else
{
    Console.WriteLine($"{Num} -> третьей цифры нет");
}




//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//--//




// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет



Console.WriteLine("Введите число дня недели: ");
int Numb = Convert.ToInt32(Console.ReadLine());
if (Numb < 6)
{
    Console.WriteLine($"{Numb} -> нет");
}
else
{
    Console.WriteLine($"{Numb} -> да");
}